tiborsimon/embedded-tdd-headers/pic/pic16/pic16c557_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16C557_H_
#define _PIC16C557_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define PORTB                         18
#define RB0                           19
#define RB1                           20
#define RB2                           21
#define RB3                           22
#define RB4                           23
#define RB5                           24
#define RB6                           25
#define RB7                           26
#define PORTC                         27
#define RC0                           28
#define RC1                           29
#define RC2                           30
#define RC3                           31
#define RC4                           32
#define RC5                           33
#define RC6                           34
#define RC7                           35
#define INTCON                        36
#define RBIF                          37
#define INTF                          38
#define T0IF                          39
#define TMR0IF                        40
#define RBIE                          41
#define INTE                          42
#define T0IE                          43
#define TMR0IE                        44
#define GIE                           45
#define OPTION_REG                    46
#define PS                            47
#define PS0                           48
#define PS1                           49
#define PS2                           50
#define PSA                           51
#define T0SE                          52
#define T0CS                          53
#define INTEDG                        54
#define nRBPU                         55
#define TRISA                         56
#define TRISA0                        57
#define TRISA1                        58
#define TRISA2                        59
#define TRISA3                        60
#define TRISA4                        61
#define TRISB                         62
#define TRISB0                        63
#define TRISB1                        64
#define TRISB2                        65
#define TRISB3                        66
#define TRISB4                        67
#define TRISB5                        68
#define TRISB6                        69
#define TRISB7                        70
#define TRISC                         71
#define TRISC0                        72
#define TRISC1                        73
#define TRISC2                        74
#define TRISC3                        75
#define TRISC4                        76
#define TRISC5                        77
#define TRISC6                        78
#define TRISC7                        79
#define PCON                          80
#define nPOR                          81

#endif // _PIC16C557_H_
